In [1]:
import pandas as pd

data = [['2020-12-8', 'toyota', 0, 1], ['2020-12-8', 'toyota', 1, 0], ['2020-12-8', 'toyota', 1, 2], ['2020-12-7', 'toyota', 0, 2], ['2020-12-7', 'toyota', 0, 1], ['2020-12-8', 'honda', 1, 2], ['2020-12-8', 'honda', 2, 1], ['2020-12-7', 'honda', 0, 1], ['2020-12-7', 'honda', 1, 2], ['2020-12-7', 'honda', 2, 1]]
daily_sales = pd.DataFrame(data, columns=['date_id', 'make_name', 'lead_id', 'partner_id']).astype({'date_id':'datetime64[ns]', 'make_name':'object', 'lead_id':'Int64', 'partner_id':'Int64'})

daily_sales

     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1
5 2020-12-08     honda        1           2
6 2020-12-08     honda        2           1
7 2020-12-07     honda        0           1
8 2020-12-07     honda        1           2
9 2020-12-07     honda        2           1

In [9]:
grouped = daily_sales.groupby(['date_id', 'make_name'])
grouped

In [11]:
for key, value in grouped:
    print(key)
    print(value)

(Timestamp('2020-12-07 00:00:00'), 'honda')
     date_id make_name  lead_id  partner_id
7 2020-12-07     honda        0           1
8 2020-12-07     honda        1           2
9 2020-12-07     honda        2           1
(Timestamp('2020-12-07 00:00:00'), 'toyota')
     date_id make_name  lead_id  partner_id
3 2020-12-07    toyota        0           2
4 2020-12-07    toyota        0           1
(Timestamp('2020-12-08 00:00:00'), 'honda')
     date_id make_name  lead_id  partner_id
5 2020-12-08     honda        1           2
6 2020-12-08     honda        2           1
(Timestamp('2020-12-08 00:00:00'), 'toyota')
     date_id make_name  lead_id  partner_id
0 2020-12-08    toyota        0           1
1 2020-12-08    toyota        1           0
2 2020-12-08    toyota        1           2

In [16]:
grouped['lead_id'].unique()

date_id     make_name
2020-12-07  honda        [0, 1, 2]
            toyota             [0]
2020-12-08  honda           [1, 2]
            toyota          [0, 1]
Name: lead_id, dtype: object

In [17]:
grouped['partner_id'].unique()

date_id     make_name
2020-12-07  honda           [1, 2]
            toyota          [2, 1]
2020-12-08  honda           [2, 1]
            toyota       [1, 0, 2]
Name: partner_id, dtype: object

In [27]:
unique_lead = grouped['lead_id'].unique().reset_index()[['lead_id']]
unique_lead

     lead_id
0  [0, 1, 2]
1        [0]
2     [1, 2]
3     [0, 1]

In [36]:
unique_lead.dtypes

dtype('int64')

In [43]:
df1 = grouped['lead_id'].nunique().reset_index()
df1

     date_id make_name  lead_id
0 2020-12-07     honda        3
1 2020-12-07    toyota        1
2 2020-12-08     honda        2
3 2020-12-08    toyota        2

In [44]:
df2 = grouped['partner_id'].nunique().reset_index()
df2

     date_id make_name  partner_id
0 2020-12-07     honda           2
1 2020-12-07    toyota           2
2 2020-12-08     honda           2
3 2020-12-08    toyota           3

In [45]:
merged_df = pd.merge(df1, df2, on=['date_id', 'make_name'])
merged_df

     date_id make_name  lead_id  partner_id
0 2020-12-07     honda        3           2
1 2020-12-07    toyota        1           2
2 2020-12-08     honda        2           2
3 2020-12-08    toyota        2           3

In [46]:
merged_df.rename(columns={'lead_id': 'unique_leads', 'partner_id': 'unique_partners'}, inplace=True)

In [47]:
merged_df

     date_id make_name  unique_leads  unique_partners
0 2020-12-07     honda             3                2
1 2020-12-07    toyota             1                2
2 2020-12-08     honda             2                2
3 2020-12-08    toyota             2                3